tap "anomalyco/tap"
tap "jandedobbeleer/oh-my-posh"
tap "oven-sh/bun"
tap "supabase/tap"
tap "davetashner/tap"
# tap "daytonaio/cli"

brew "asdf"  # Manage multiple versions of software
brew "lz4"  # Extremely Fast Compression algorithm
brew "openssl@3"  # Cryptography and SSL/TLS Toolkit
brew "zstd"  # Zstandard is a real-time compression algorithm
brew "gettext"  # GNU internationalization (i18n) and localization (l10n) library
brew "pcre2"  # Perl compatible regular expressions library with a new API
brew "glib"  # Core application library for C
brew "cairo"  # Vector graphics library with cross-device output support
brew "fribidi"  # Implementation of the Unicode BiDi algorithm
brew "graphite2"  # Smart font renderer for non-Roman scripts
brew "harfbuzz"  # OpenType text shaping engine
brew "icu4c@77"  # C/C++ and Java libraries for Unicode and globalization
brew "pango"  # Framework for layout and rendering of i18n text
brew "brotli"  # Generic-purpose lossless compression algorithm by Google
brew "autoconf"  # Automatic configure script builder
brew "automake"  # Tool for generating GNU Standards-compliant Makefiles
brew "awscli"  # Official Amazon AWS command-line interface
brew "bat"  # Clone of cat(1) with syntax highlighting and Git integration
brew "beads"  # Memory upgrade for your coding agent
brew "ccache"  # Object-file caching compiler wrapper
brew "cmake"  # Cross-platform make
# brew "daytonaio/cli/daytona"  # Daytona CLI https://daytona.io
brew "libyaml"  # YAML Parser
brew "coreutils"  # GNU File, Shell, and Text utilities
brew "csvkit"  # Suite of command-line tools for converting to and working with CSV
brew "curl"  # Get a file from an HTTP, HTTPS or FTP server
brew "deno"  # Secure runtime for JavaScript and TypeScript
brew "devcontainer"  # Reference implementation for the Development Containers specification
brew "unbound"  # Validating, recursive, caching DNS resolver
brew "gnutls"  # GNU Transport Layer Security (TLS) Library
brew "libgcrypt"  # Cryptographic library based on the code from GnuPG
brew "gnupg"  # GNU Privacy Guard (OpenPGP)
brew "poppler"  # PDF rendering library (based on the xpdf-3.0 code base)
brew "diskus"  # Minimal, fast alternative to 'du -sh'
brew "docbook"  # Standard XML representation system for technical documents
brew "docbook-xsl"  # XML vocabulary to create presentation-neutral documents
brew "dolt"  # Git for Data
brew "doxygen"  # Generate documentation for several programming languages
brew "dust"  # More intuitive version of du in rust
brew "expect"  # Program that can automate interactive applications
brew "eza"  # Modern, maintained replacement for ls
brew "findutils"  # Collection of GNU find, xargs, and locate
brew "fzf"  # Command-line fuzzy finder written in Go
brew "gemini-cli"  # Interact with Google Gemini AI models from the command-line
brew "gastown"  # Multi-agent workspace manager
brew "gawk"  # GNU awk utility
brew "gcc"  # GNU compiler collection
brew "gh"  # GitHub command-line tool
brew "tesseract"  # OCR (Optical Character Recognition) engine
brew "ghostscript"  # Interpreter for PostScript and PDF
brew "git-lfs"  # Git extension for versioning large files
brew "glow"  # Render markdown on the CLI
brew "gnu-getopt"  # Command-line option parsing utility
brew "gnu-indent"  # C code prettifier
brew "pkgconf"  # Package compiler and linker metadata toolkit
# brew "goenv"  # Go version management
brew "gperftools"  # Multi-threaded malloc() and performance analysis tools
brew "graphviz"  # Graph visualization software from AT&T and Bell Labs
brew "guile"  # GNU Ubiquitous Intelligent Language for Extensions
brew "gzip"  # Popular GNU data compression program
brew "httpie"  # User-friendly cURL replacement (command-line HTTP client)
brew "hyperfine"  # Command-line benchmarking tool
brew "shared-mime-info"  # Database of common MIME types
brew "libheif"  # ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "imagemagick"  # Tools and libraries to manipulate images in select formats
brew "jansson"  # C library for encoding, decoding, and manipulating JSON
brew "jpeg"  # Image manipulation library
brew "jq"  # Lightweight and flexible command-line JSON processor
brew "ldns"  # DNS library written in C
brew "less"  # Pager program similar to more
brew "snappy"  # Compression/decompression library aiming for high speed
brew "leveldb"  # Key-value storage library with ordered mapping
brew "libffi"  # Portable Foreign Function Interface library
brew "libilbc"  # Packaged version of iLBC codec from the WebRTC project
brew "libmagic"  # Implementation of the file(1) command
brew "libmaxminddb"  # C library for the MaxMind DB file format
brew "libpthread-stubs"  # X.Org: pthread-stubs.pc
brew "libsmi"  # Library to Access SMI MIB Information
brew "libssh"  # C library SSHv1/SSHv2 client and server protocols
brew "libxml2"  # GNOME XML library
brew "libxmlsec1"  # XML security library
brew "llvm"  # Next-gen compiler infrastructure
brew "lolcat"  # Rainbows and unicorns in your console!
brew "make"  # Utility for directing compilation
brew "ninja"  # Small build system for use with gyp or CMake
brew "minizip"  # C library for zip/unzip via zLib
brew "mkcert"  # Simple tool to make locally trusted development certificates
brew "moor"  # Nice to use pager for humans
brew "protobuf"  # Protocol buffers (Google's data interchange format)
brew "mtr"  # 'traceroute' and 'ping' in a single tool
brew "neovim"  # Ambitious Vim-fork focused on extensibility and agility
brew "pcre"  # Perl compatible regular expressions library
brew "perl"  # Highly capable, feature-rich programming language
brew "pgcli"  # CLI for Postgres with auto-completion and syntax highlighting
# brew "pyenv"  # pyenv python version manager
brew "sbcl"  # Steel Bank Common Lisp system
brew "sqlite"  # Command-line interface for SQLite
brew "pgloader"  # Data loading tool for PostgreSQL
brew "pillow"  # Friendly PIL fork (Python Imaging Library)
brew "pipx"  # Execute binaries from Python packages in isolated environments
brew "popt"  # Library like getopt(3) with a number of enhancements
brew "postgresql@18", link: true  # Object-relational database system
brew "procs"  # Modern replacement for ps written in Rust
brew "pygments"  # Generic syntax highlighter
# brew "rbenv"  # Ruby version manager
brew "redis"  # Persistent key-value database, with built-in net interface
brew "ripgrep"  # Search tool like grep and The Silver Searcher
brew "rsync"  # Utility that provides fast incremental file transfer
brew "sad"  # CLI search and replace | Space Age seD
brew "screen"  # Terminal multiplexer with VT100/ANSI terminal emulation
brew "shellcheck"  # Static analysis and lint tool, for (ba)sh scripts
brew "shfmt"  # Autoformat shell script source code
brew "sqlfluff"  # SQL linter and auto-formatter for Humans
brew "step"  # Crypto and x509 Swiss-Army-Knife
brew "davetashner/tap/stringer"  # Codebase archaeology tool that mines git repos for actionable Beads issues
brew "swig"  # Generate scripting interfaces to C/C++ code
brew "tmux"  # Terminal multiplexer
brew "tree"  # Display directories as trees (with optional color/HTML output)
brew "unzip"  # Extraction utility for .zip compressed archives
brew "uv"  # Extremely fast Python package installer and resolver, written in Rust
brew "vim"  # Vi 'workalike' with many additional features
brew "volta"  # JavaScript toolchain manager for reproducible environments
brew "watch"  # Executes a program periodically, showing output fullscreen
brew "wdiff"  # Display word differences between text files
brew "xmlto"  # Convert XML to another format (based on XSL or other tools)
brew "yajl"  # Yet Another JSON Library
brew "yq"  # Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "anomalyco/tap/opencode"  # The AI coding agent built for the terminal.
brew "jandedobbeleer/oh-my-posh/oh-my-posh"  # Prompt theme engine for any shell
# brew "oven-sh/bun/bcun", link: false  # Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "supabase/tap/supabase"  # Supabase CLI

